FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M7_SAMV71_Xplained_IAR_Keil/libchip_samv7/include/samv7/component/component_twihs.h
#define TWIHS_FILTR_PADFEN           ( 0x1u << 1 )                     /**< \brief (TWIHS_FILTR) PAD Filter Enable */
#define TWIHS_FILTR_PADFCFG          ( 0x1u << 2 )                     /**< \brief (TWIHS_FILTR) PAD Filter Config */
#define TWIHS_FILTR_THRES_Pos        8
#define TWIHS_FILTR_THRES_Msk        ( 0x7u << TWIHS_FILTR_THRES_Pos ) /**< \brief (TWIHS_FILTR) Digital Filter Threshold */
#define TWIHS_FILTR_THRES( value )    ( ( TWIHS_FILTR_THRES_Msk & ( ( value ) << TWIHS_FILTR_THRES_Pos ) ) )
/* -------- TWIHS_SWMR : (TWIHS Offset: 0x4C) SleepWalking Matching Register -------- */
#define TWIHS_SWMR_SADR1_Pos         0
#define TWIHS_SWMR_SADR1_Msk         ( 0x7fu << TWIHS_SWMR_SADR1_Pos ) /**< \brief (TWIHS_SWMR) Slave Address 1 */
#define TWIHS_SWMR_SADR1( value )    ( ( TWIHS_SWMR_SADR1_Msk & ( ( value ) << TWIHS_SWMR_SADR1_Pos ) ) )
#define TWIHS_SWMR_SADR2_Pos         8
#define TWIHS_SWMR_SADR2_Msk         ( 0x7fu << TWIHS_SWMR_SADR2_Pos ) /**< \brief (TWIHS_SWMR) Slave Address 2 */
#define TWIHS_SWMR_SADR2( value )    ( ( TWIHS_SWMR_SADR2_Msk & ( ( value ) << TWIHS_SWMR_SADR2_Pos ) ) )
#define TWIHS_SWMR_SADR3_Pos         16
#define TWIHS_SWMR_SADR3_Msk         ( 0x7fu << TWIHS_SWMR_SADR3_Pos ) /**< \brief (TWIHS_SWMR) Slave Address 3 */
#define TWIHS_SWMR_SADR3( value )    ( ( TWIHS_SWMR_SADR3_Msk & ( ( value ) << TWIHS_SWMR_SADR3_Pos ) ) )
#define TWIHS_SWMR_DATAM_Pos         24
#define TWIHS_SWMR_DATAM_Msk         ( 0xffu << TWIHS_SWMR_DATAM_Pos ) /**< \brief (TWIHS_SWMR) Data Match */
#define TWIHS_SWMR_DATAM( value )    ( ( TWIHS_SWMR_DATAM_Msk & ( ( value ) << TWIHS_SWMR_DATAM_Pos ) ) )
/* -------- TWIHS_DR : (TWIHS Offset: 0xD0) Debug Register -------- */
#define TWIHS_DR_SWEN                ( 0x1u << 0 )                          /**< \brief (TWIHS_DR) SleepWalking Enable */
#define TWIHS_DR_CLKRQ               ( 0x1u << 1 )                          /**< \brief (TWIHS_DR) Clock Request */
#define TWIHS_DR_SWMATCH             ( 0x1u << 2 )                          /**< \brief (TWIHS_DR) SleepWalking Match */
#define TWIHS_DR_TRP                 ( 0x1u << 3 )                          /**< \brief (TWIHS_DR) Transfer Pending */
/* -------- TWIHS_WPMR : (TWIHS Offset: 0xE4) Protection Mode Register -------- */
#define TWIHS_WPMR_WPEN              ( 0x1u << 0 )                          /**< \brief (TWIHS_WPMR) Write Protection Enable */
#define TWIHS_WPMR_WPKEY_Pos         8
#define TWIHS_WPMR_WPKEY_Msk         ( 0xffffffu << TWIHS_WPMR_WPKEY_Pos )  /**< \brief (TWIHS_WPMR) Write Protection Key */
#define   TWIHS_WPMR_WPKEY_PASSWD    ( 0x545749u << 8 )                     /**< \brief (TWIHS_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0 */
/* -------- TWIHS_WPSR : (TWIHS Offset: 0xE8) Protection Status Register -------- */
#define TWIHS_WPSR_WPVS              ( 0x1u << 0 )                          /**< \brief (TWIHS_WPSR) Write Protect Violation Status */
#define TWIHS_WPSR_WPVSRC_Pos        8
#define TWIHS_WPSR_WPVSRC_Msk        ( 0xffffffu << TWIHS_WPSR_WPVSRC_Pos ) /**< \brief (TWIHS_WPSR) Write Protection Violation Source */
/* -------- TWIHS_VER : (TWIHS Offset: 0xFC) Version Register -------- */
#define TWIHS_VER_VERSION_Pos        0
#define TWIHS_VER_VERSION_Msk        ( 0xfffu << TWIHS_VER_VERSION_Pos ) /**< \brief (TWIHS_VER) Version of the Hardware Module */
#define TWIHS_VER_MFN_Pos            16
#define TWIHS_VER_MFN_Msk            ( 0x7u << TWIHS_VER_MFN_Pos )       /**< \brief (TWIHS_VER) Metal Fix Number */

/*@}*/


#endif /* _SAM_TWIHS_COMPONENT_ */
